{"id":14394,"date":"2021-08-14T05:16:24","date_gmt":"2021-08-14T05:16:24","guid":{"rendered":"https:\/\/nupuganda.org\/our-donation-is-hope-for-poor-childrens-copy\/"},"modified":"2021-08-14T05:16:24","modified_gmt":"2021-08-14T05:16:24","slug":"statement-by-hon-kyagulanyi-ssentamu-robert-about-the-return-of-motor-vehicle-reg-no-ubj-667f","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/statement-by-hon-kyagulanyi-ssentamu-robert-about-the-return-of-motor-vehicle-reg-no-ubj-667f\/","title":{"rendered":"STATEMENT BY HON. KYAGULANYI SSENTAMU ROBERT ABOUT THE RETURN OF MOTOR VEHICLE REG. NO. UBJ 667F"},"content":{"rendered":"<p>Yesterday, I received a phone call from one of our lawyers Anthony Wameli who informed me that he had received a call from a Commissioner at URA requesting us to pick the bulletproof vehicle which was impounded by URA more than two months ago.<\/p>\n<p>Like we repeatedly said to the nation, there was no legal basis whatsoever for URA to impound the vehicle in the first place! This is a car which was fully inspected by URA, Interpol and the police forensics department before the tax was assessed and levied. We accordingly paid the tax in full, and a Ugandan number plate was issued. The story changed when it was discovered that the car belonged to me. URA immediately moved to impound the vehicle claiming that their initial assessment had been wrong. They would then impose a new exorbitant tax of 337 million shillings!<\/p>\n<p>These past weeks, our legal team embarked on the process of challenging the tax before the Tax Appeals Tribunal, but before then we were required to apply for revaluation of the tax before the Commissioner in charge of customs.<\/p>\n<p>It was therefore shocking for me to receive this letter accompanying the vehicle this morning, with a claim that the car was being released on Gen. Museveni’s orders, while at the same time stipulating that I am still required to pay the tax.<\/p>\n<p>What do we read from this?<\/p>\n<ol>\n<li>Gen. Museveni continues to misrule our nation and to treat it as his personal property. He has turned himself into the law. He ordered for the impounding of the vehicle without regard to the law, and has now ordered for its release without making reference to the law. This is how he is treating all of us citizens- he chooses when to put you under house arrest and when to release you! He orders for the abduction of citizens who are kept for weeks or months until he decides to release them or to take them to court. We must struggle to build a country which works. If indeed I owe any taxes, Gen. Museveni should have no right to order for the release of my vehicle before I pay the taxes! URA and indeed all government institutions must be independent and not operate on the wishes and whims of anyone.<\/li>\n<li>There is a deliberate attempt to divert us from our most critical assignment to liberate our nation. The regime has been deliberate on engaging citizens in insignificant debates so as to turn their focus away from the rigged election, the murders and abductions and such other evils. As I speak, the abductions of our people are still ongoing. Our people are still being tortured to death while others are being held incommunicado. This very day, comrades who are at Kitalya were meant for a ruling on their bail application, but the regime deliberately refused to bring them without giving any reason, while other cases were ongoing. Therefore comrades, there must be nothing to divert us from the most critical agenda.<\/li>\n<li>The regime is alive to the danger it continues to pause on my life and indeed the lives of many other citizens in prominent roles. The attempted assassination of Gen. Katumba Wamala last week speaks to what is going on. Perhaps it was because of the demand from many of you citizens since the events of last week, that the regime decided to cover up and put away the focus. This will certainly not give me any more sense of security, because I believe that none of us is safe until this regime of blood and shame is gone.<\/li>\n<\/ol>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"alignnone  wp-image-15359\" src=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/08\/FB_IMG_1623237009354-225x300.jpg\" alt=\"\" width=\"541\" height=\"721\" srcset=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/08\/FB_IMG_1623237009354-225x300.jpg 225w, https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/08\/FB_IMG_1623237009354.jpg 720w\" sizes=\"(max-width: 541px) 100vw, 541px\" \/><\/p>\n<p>A clearance letter for our armoured vehicle from URA.<\/p>\n<p><\/p>\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday, I received a phone call from one of our lawyers Anthony Wameli who informed me that he had received a call from a Commissioner at URA requesting us to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":15361,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[59,60,61],"class_list":["post-14394","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates","tag-charity","tag-give","tag-help"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/14394","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=14394"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/14394\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/15361"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=14394"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=14394"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=14394"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}