{"id":15832,"date":"2021-12-31T15:25:57","date_gmt":"2021-12-31T15:25:57","guid":{"rendered":"https:\/\/nupuganda.org\/?p=15832"},"modified":"2021-12-31T15:25:57","modified_gmt":"2021-12-31T15:25:57","slug":"end-of-year-message-from-president-kyagulanyi-ssentamu-robert","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/end-of-year-message-from-president-kyagulanyi-ssentamu-robert\/","title":{"rendered":"END OF YEAR MESSAGE FROM PRESIDENT KYAGULANYI SSENTAMU ROBERT"},"content":{"rendered":"\n<p><strong>Fellow countrymen and women<\/strong>,<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I bring you warm greetings wherever you are and congratulate you upon coming to and end of this year, which has been a very difficult one for many Ugandans.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I thank God for the gift of life. It is not something to take for granted, that those of us who are alive today have that opportunity.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I send deepest condolences and sympathies to all Ugandans who have lost loved ones this year and pray that those who are sick will have a quick and full recovery.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">As we come to the end of the year, my message will focus on three issues:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li><strong>A MESSAGE OF GRATITUDE<\/strong><\/li><\/ol>\n\n\n\n<p class=\"has-normal-font-size\">Let me take this opportunity to send deep gratitude to all Ugandans who continue to support the struggle against the dictatorship.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">As we all know, at the start of the year, we had a presidential election, which General Museveni chose to turn into a military operation. Ugandans were murdered, tortured, abducted and others detained. As I write this, we still have hundreds of our people in different prisons across the country including Members of Parliament Muhammad Ssegirinya and Allan Ssewanyana. Ordinary Ugandans such as Olivia Lutaaya, Kassim Mugadde, Machete Yasin, and many others are under illegal detention and there is no sign of getting a free and fair trial. Comrades Nubian Li, Eddie Mutwe, Dan Magic and many others spent more than half of this year in prison. There are several other comrades who have lost limbs in this cause, while many others have paid the ultimate price.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I want to salute EVERYONE who has made any form of sacrifice in order to advance the struggle for a better country.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Our brothers and sisters in the diaspora, I THANK YOU. Thank you for knocking on doors, speaking out, organising demonstrations, reporting those who abuse human rights to relevant organs and organisations, and supporting the struggle with logistics.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Thank you all for the tireless efforts. Even after Dictator Museveni grabbed our victory, many of you could have felt discouraged. But I am thankful to all of you who have not given up.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I want to thank, in a special way, all non-Ugandans who continue to support our struggle in different ways. The nations which are beginning to act against Museveni and his henchmen, the artistes who have been raising voices against human rights abuses in Uganda, the international media which has continued to shine a light on the injustices, and all those who have contributed in one way or another, THANK YOU.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I thank the millions of people in Uganda and abroad who send us prayers and messages of encouragement. THANK YOU<\/p>\n\n\n\n<ol class=\"wp-block-list\" start=\"2\"><li><strong>THE BALANCE OF FORCES<\/strong><\/li><\/ol>\n\n\n\n<p>Many people might be wondering how the struggle against dictatorship in Uganda stands.<\/p>\n\n\n\n<p>Let me use this message to once again affirm to all our people that the balance of forces is in the favor of the people of Uganda. All dictators, past and present follow the same path. Yes, Museveni grabbed the victory of Ugandans and has continued to misrule us through the barrel of the gun. But he is not as strong as he used to be. He is not as insulated as he used to be. And he is definitely much more vulnerable than he has ever been.<\/p>\n\n\n\n<p>Our greatest achievement so far, has been stripping him naked. The whole world now knows that Uganda is ruled by a military tyrant who has no legitimate support of the people. This is an important achievement in any struggle to remove a dictatorship.<\/p>\n\n\n\n<p>Secondly, the people of Uganda are now more awakened than ever. I pride in seeing Ugandans, young and old much more interested in the affairs of our country.<\/p>\n\n\n\n<p>Fighting an entrenched dictatorship is not and has never been easy anywhere. When we spoke of #Mission2021 we were alive to these realities. I thank everyone who has contributed the achievements registered this year. We may not have gotten our ultimate goal yet, but I want to assure everyone that we are on the right trajectory. If each one of us makes a commitment to do twice as much as we have done this year in this effort, we shall all be amazed at what we shall achieve. I say all this, well knowing that God is on our side.<\/p>\n\n\n\n<ol class=\"wp-block-list\" start=\"3\"><li><strong>A RESPONSE ON UNITY<\/strong><\/li><\/ol>\n\n\n\n<p class=\"has-normal-font-size\">After the Kayunga by-election fraud, I read with dismay several comments on social media about some issues. While most are sponsored or posted by people with a clearly destructive agenda, others are posted by people with genuine intentions, but who clearly do not have the full picture.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Some people made it a point to accuse the National Unity Platform of going alone in the Kayunga by-election, arguing that perhaps if we were united we would be declared winners.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">First of all, WE WON THE ELECTION in Kayunga. We won it by a landslide- a clear 15000 vote lead. We deployed agents and supervisors, most of whom were arrested before the regime usurped the will of the people. There has been rigging in very many elections, but what they did in Kayunga was a new record. An election where you have all DR forms giving you a 15000 lead and the Returning Officer aided by Byabakama announces a different winner.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">This is what everyone who claims to struggle for democracy should focus on. How do we get our nation from this mess?<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Away from that, I wish to remind all Ugandans that the People Power Movement\/ National Unity Platform has championed the unity of the forces of change right from inception. After the 2017 by-election in Kyadondo East that brought me to Parliament, I set out to meet with all leaders of political parties, Civil Society Organisations, religious institutions, etc. When we formed the People Power Movement, we brought together Ugandans from all shades of opinion. This is because in principle we believe that all Ugandans (not just politicians) will need to come together and forge a way forward towards a #NewUganda.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">The challenge has always been the dishonesty in some cases and inconsistency in other cases. Some actors have clearly placed personal interest ahead of the national interest. There are many lessons we have learnt in trying to forge this unity, most of which we do not make public, because giving certain details can easily lead to further mistrust and suspicion.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">For about two years before the election, we sat in more than fifty meetings with leaders and comrades within different formations in the &#8216;opposition&#8217;. Our view was that we needed to tackle Museveni with a single, strong candidate so that we would then scatter our energies across the country in trying to guard the vote. I was even willing not to be the joint candidate, if an honest analysis had been made and it was established that we front someone else. The discussions went on and on and on.<br>Previously before we launched the National Unity Platform , some of the Party leaders kept telling us they needed to consult their party organs. Others told us they needed to first elect their party flag bearers, who would then sit with us to agree on a joint candidate. Others claimed that they could not work with us because we were just a mere pressure group and not a registered political party.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">It later became apparent that some of the actors were in fact not interested in our unity at all, but were using those meetings and engagements to derail and delay us. In fact, one of the last and most important meetings we had to discuss the question of unity took place at the home of Owek. Joyce Ssebugwaawo, now Museveni&#8217;s minister. It was later on that we established that all along she had been in touch with the regime, although she was a Deputy President of a major opposition party.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">When we formed NUP and were taken to court, some of the people who worked very hard to see NUP de-registered were not NRM operatives, but some of our perceived comrades in other opposition formations. Some went as far as approaching the Electoral Commission and Court staff to beg that they influence our de-registration.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Some of these people were not necessarily working for the regime, but felt that if we had a political party, we would take over their space. You can imagine!<br>While we are busy fighting to see the regime down, some actors were very comfortable with their positions within the opposition!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">By the time we went through the election and emerged out of it, we got credible information, (which is well within the knowledge of senior leaders), that Museveni sponsored several candidates at different levels in order to cut our speed.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">As everyone can see, this is information that we normally get and decide to keep with ourselves, but I thought it is important to share it so that the people of Uganda understand the dynamics at play, and place the most trust in themselves. No one else will fight for them except themselves.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Of course not all actors within the forces of change have this negative attitude. There are very many decent, clear headed individuals whose objective is to see change in Uganda.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Immediately after the election, every Ugandan remembers that I personally wrote to all heads of political parties, in order for us to forge unity and take the struggle forward. Yet again, some actors responded positively, others responded negatively and others did not respond at all.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">With all these setbacks, we have not given up on unity, but our view remains that the most important unity will have to come from the people of Uganda, and not just politicians. That is why we are the NATIONAL UNITY PLATFORM. Although we had many parties keen to have us take them over and lead them, our decision to take over NUP was consciously made because of our belief in National Unity.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Of course we continue to engage with all Ugandans, be it political leaders or not, on the urgent need to deliver our nation from the crisis which we face. This coming year, we must make a conscious decision to work together as comrades because the alternative would be to resign ourselves to a terrible fate.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">In the coming year, each one of is should simply double his or her effort while trusting in God. Freedom is in sight.<\/p>\n\n\n\n<p><strong>Happy New Year to you all. God bless you<\/strong>.<\/p>\n\n\n\n<p><strong>Kyagulanyi Ssentamu Robert &#8220;Bobi Wine<\/strong>&#8220;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fellow countrymen and women, I bring you warm greetings wherever you are and congratulate you upon coming to and end of this year, which has been a very difficult one [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":15834,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-15832","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15832","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=15832"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15832\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/15834"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=15832"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=15832"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=15832"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}