{"id":15885,"date":"2022-01-05T17:00:22","date_gmt":"2022-01-05T17:00:22","guid":{"rendered":"https:\/\/nupuganda.org\/?p=15885"},"modified":"2022-01-05T17:00:22","modified_gmt":"2022-01-05T17:00:22","slug":"on-propaganda","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/on-propaganda\/","title":{"rendered":"ON PROPAGANDA"},"content":{"rendered":"\n<p class=\"has-normal-font-size\">BY <strong>PRESIDENT<\/strong> <strong>KYAGULANYI<\/strong> <strong>SSENTAMU<\/strong> <strong>ROBERT<\/strong> <\/p>\n\n\n\n<p>Several times, I have spoken about how dictatorial regimes use propaganda as a tool to keep themselves in power against the will of the citizens. I also explained how such regimes spend billions of monies on propaganda- the same money which would improve services for the people. <\/p>\n\n\n\n<p>In Uganda, there are many paid propagandists who come in all shapes and sizes. Their approaches are different, but their objective is the same- perpetration of the Museveni regime of blood.&nbsp;<\/p>\n\n\n\n<p>I worry less about such people because their objective is well known. The people I worry about are those who actually give them ear and eventually believe what they say. I have seen a few comrades, who were once very committed to the struggle, but have since drifted away from the cause by simply listening to the toxic messages of propagandists who are well trained and well facilitated. We have reliable information on how several of them have received advanced training in manufacturing and propagating propaganda.&nbsp;<\/p>\n\n\n\n<p>I will describe some of their approaches that I have observed for some time.&nbsp;<\/p>\n\n\n\n<p><strong>1.&nbsp;&nbsp;Some&nbsp;propagandists&nbsp;usually&nbsp;begin as&nbsp;purported&nbsp;enthusiastic&nbsp;supporters of&nbsp;the&nbsp;struggle,&nbsp;but&nbsp;step by step,&nbsp;they start attacking comrades,&nbsp;or&nbsp;they&nbsp;start&nbsp;making unreasonable demands&nbsp;and&nbsp;then&nbsp;attack the leadership with all manner of accusations.<\/strong>&nbsp;<\/p>\n\n\n\n<p>They&nbsp;usually begin with so much passion, but they normally have a time frame. For example, for the first six months, someone may come out&nbsp;every&nbsp;day&nbsp;criticising Museveni and his corrupt regime online, on radio stations or TVs. But such a person is on a clear mission. His criticism for six months is meant to help him gain attention and a huge following. After the six months when he has your ears and attention, you see the person turn the guns on the struggle which they purported to support.&nbsp;<\/p>\n\n\n\n<p>Usually, such individuals start slow. They never wake up at once and attack the struggle. No. They take you step by step.&nbsp;<\/p>\n\n\n\n<p>They may begin by making complaints which may appear genuine about how things are moving within the struggle. Then they pick on a few comrades who they consider weak and start attacking them for no solid reason. True to their character, they come up with well-crafted, believable lies about those comrades. They normally take some time before launching an all-out war on the cause.&nbsp;<\/p>\n\n\n\n<p>Sometimes, they look for, or create justification for their intended actions. Someone may attack a comrade within the struggle and when that comrade responds, the propagandist uses that as an opportunity to call everyone else a hooligan. And that becomes their starting point. Another person may make some unreasonable demands from the leadership well knowing that it is not possible for those demands to be granted. Once that happens, they use it as an opportunity to launch all manner of accusations against the cause and its leadership. Ultimately, their intention is to divert, derail and divert the cause. Beware of them!&nbsp;<\/p>\n\n\n\n<p>Of course,&nbsp;this is not intended to silence those who come up with genuine advice or even constructive criticism. But I am sure all of us have seen how the propagandists described above behave.&nbsp;<\/p>\n\n\n\n<p><strong>2.&nbsp;&nbsp;Some&nbsp;propagandists appear on the scene and claim to belong to the forces of change&nbsp;and&nbsp;claim to&nbsp;know how everything should run&nbsp;but they&nbsp;never participate in the implementation of any&nbsp;strategy and&nbsp;have a negative explanation for every situation.<\/strong>&nbsp;<\/p>\n\n\n\n<p>They claim not to support the regime but if you analyse their presentations, you will see that they spend 80% of their time attacking the leaders within the struggle or the methods adopted in the struggle. They spend only 20% or less of their time talking about how they do not like Museveni and his corrupt regime. These ones claim to know how everything should&nbsp;run but&nbsp;are never willing or even able to come and be part of the implementation of what they say. In fact, their approach is to attack every strategy you adopt. If NUP leadership does not call for protests, they will criticise us every day for not calling for protests. When you hear them speak, you may think they will be the first people on the street when protests are called. Their intention here is to project the leaders of the struggle as weak and ineffective. But as soon as NUP leadership calls for protests, they will immediately change the script. “Bobi Wine is sending innocent people to be killed. Let him send his children first on the streets,” they will say. Their intention here is to discourage people from coming out to protest. They are basically always waiting for you to take a step and immediately find reason to attack it.&nbsp;<\/p>\n\n\n\n<p>I saw such things about the recent Kayunga election fraud. They first asked why we were all focused on Kayunga as if the rest of the country did not matter! On the day of voting, when the results showed us in a clear win, they said Museveni was giving that one to us. One of them said, “If Museveni did not want NUP to win, they would not have won”.&nbsp;By morning when Byabakama and Kyobutungi announced their coup, they asked why NUP did not focus fully on Kayunga and ensure they collected DR forms! But by 2:00pm the same day, when we uploaded all the DR forms and proved we guarded the vote 100%, they asked why we went to Kayunga in the first place, well knowing that the election&nbsp;would be rigged! You can&nbsp;imagine. That&nbsp;is their nature. They have a negative explanation for every situation.&nbsp;<\/p>\n\n\n\n<p>For such people, when their following starts declining because people are beginning to understand their mission, they change strategy a bit. For some two or three weeks, they once again attack Museveni at 60% of their time. Then the comrades who had gone away from them now start thinking they are back into the cause. But once they have the attention again, they immediately go back to their mission, now more viciously than before.&nbsp;<\/p>\n\n\n\n<p><strong>3.&nbsp; Some&nbsp;propagandists&nbsp;come&nbsp;on the scene and claim to love and support the overall leader of the&nbsp;struggle,&nbsp;but they will&nbsp;attack and criticise everyone he works with.<\/strong>&nbsp;<\/p>\n\n\n\n<p>&nbsp;In our case, they will claim to love me 100%. But when you watch them closely, you realise that they attack everyone else around me. Because they understand that a leader cannot work alone, their intention is to weaken the leader without attacking him directly. Watch them.&nbsp;<\/p>\n\n\n\n<p><strong>4.&nbsp; Some&nbsp;propagandists&nbsp;are clearly for the&nbsp;regime.&nbsp;They don’t hide it&nbsp;and&nbsp;they&nbsp;blatantly&nbsp;utter&nbsp;lies.<\/strong>&nbsp;<\/p>\n\n\n\n<p>Their antennas are always alert, looking for anything negative to say about the struggle. When they don’t find it, they go to their laboratory and immediately manufacture lies and more lies. They will claim that I bought a house in America. Once they are busted, they immediately claim that Museveni bought for me the bullet proof car. They ask, “How could he have brought in the bullet proof car without the regime knowing?” And when Museveni confiscates the same car? They immediately turn around and say I got the car from my foreign funders to destabilise the country. Another example is the sick lie that NUP refused to join IPOD but attend meetings!&nbsp;They say lies with their eyes wide open.&nbsp;<\/p>\n\n\n\n<p>This&nbsp;category is easier to deal with because their actions and intentions are very clear.&nbsp;<\/p>\n\n\n\n<p>There are other approaches, but because of time, I’ll only speak about these&nbsp;four categories.&nbsp;<\/p>\n\n\n\n<p>People who are genuinely for the cause should learn to discern why someone says or does what they do. It is very important.&nbsp;<\/p>\n\n\n\n<p>Above all things, all dictators, past and present have used these schemes and more. But it never saves them from the inevitable fall. The struggle for freedom and democracy will end in victory.&nbsp;<\/p>\n\n\n\n<p><strong><em>Kyagulanyi Ssentamu Robert “Bobi Wine”<\/em><\/strong>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BY PRESIDENT KYAGULANYI SSENTAMU ROBERT Several times, I have spoken about how dictatorial regimes use propaganda as a tool to keep themselves in power against the will of the citizens. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":15886,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-15885","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15885","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=15885"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15885\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/15886"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=15885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=15885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=15885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}