{"id":15932,"date":"2022-01-16T16:26:20","date_gmt":"2022-01-16T16:26:20","guid":{"rendered":"https:\/\/nupuganda.org\/?p=15932"},"modified":"2022-01-16T16:26:20","modified_gmt":"2022-01-16T16:26:20","slug":"statement-on-renewed-lies-and-propaganda-by-state-apologists","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/statement-on-renewed-lies-and-propaganda-by-state-apologists\/","title":{"rendered":"STATEMENT ON RENEWED LIES AND PROPAGANDA BY STATE APOLOGISTS"},"content":{"rendered":"\n<p>We have noted with concern the renewed effort by the regime and its proxies to put out lies and propaganda against the National Unity Platform and its leadership. Like we have consistently said, the regime uses such propaganda to discourage our people, divide us and eventually derail our cause. We ordinarily would not respond to this propaganda well knowing the intentions of those who sponsor it. However, for the sake of our people who may be misled, we shall set the record straight on some matters. <\/p>\n\n\n\n<p>The recent lies and propaganda relate to the following;<\/p>\n\n\n\n<p> 1. <strong>The agenda and outcomes of our meeting with the Members of Parliament.<\/strong><\/p>\n\n\n\n<p> Even some media houses carried falsehoods that our meeting focused on disagreements within the party! Everyone who attended that meeting knows that 90% of our focus was on how to continue and intensify the struggle against dictatorship and misrule. The other time was spent on some administrative matters, including giving accountability to the Parliamentary caucus on their contributions, agreeing on upcoming party activities, and encouraging the leaders to prioritise the question of political prisoners. The meeting was cordial with very clear outcomes! But Museveni and his proxies will always use every opportunity to project us as people who are clashing amongst ourselves because that is how the regime survives. Please watch carefully, and treat with contempt anyone who carries such lies and propaganda. <\/p>\n\n\n\n<p>2. <strong>Regime operatives and propagandists have intensified lies relating<\/strong> <strong>to how NUP raises funds for its use<\/strong>.<\/p>\n\n\n\n<p>. There has been deliberate misinformation that NUP received billons from IPOD and that NUP elected leaders contribute money to individual leaders within the party, etc. Nonsense! As we recently clarified, NUP only receives monthly contributions from its elected MPs and every once in a while disbursements allocated by Parliament. Since January, the Party even put a halt on public fundraising be it local or from the diaspora, except a few volunteers who have continued to support welfare and medical treatment for injured comrades. It is important to also categorically state that our President, His Excellency <a href=\"https:\/\/www.facebook.com\/www.bobiwine.ug\" data-type=\"URL\" data-id=\"https:\/\/www.facebook.com\/www.bobiwine.ug\">Kyagulanyi Ssentamu Robert<\/a> has never charged NUP any money for using his premises for party activities. Right from the inception of the People Power Movement, he availed his property free of charge to be used for party activities. Shameless propagandists also claimed that some leaders signed MOUs with some party leaders to keep sending them money! A shameless bunch of people! The regime usually tries to sponsor such lies first and foremost to discourage the comrades who volunteer for the cause. We have been approached by leaders who tell us that the regime uses that trick in trying to compromise them. When they want to compromise leader X, they tell him that you see the top leaders are swimming in money while you are suffering. If leader X is not strong or even wise enough to read through the lies, they are able to take him. Our people must remain alert and dismiss such lies.<\/p>\n\n\n\n<p>3. <strong>There is increased propaganda intended to divide our people on ethnic lines.<\/strong> <\/p>\n\n\n\n<p>Some individuals claiming to support the struggle deliberately try to project NUP as though it&#8217;s for one ethnic group. Others have made it a point to discredit some comrades solely based on their ethnic origin. The intention is to deliberately isolate us, and cause fear amongst people from various ethnic backgrounds. This is most unfortunate. NUP is the National Unity Platform. We believe in National Unity as the first value, and we judge individuals by their ACTIONS not what language they speak. In any case, there are people who Museveni uses to oppress us from different parts of the country. Likewise, those involved in trying to liberate our nation from the mess come from different parts of the country. Museveni, the chief tribalist and his people know how to play reverse psychology and we must never fall for that. Anybody who places ethnicity ahead of national interest is an enemy of Uganda and an enemy of the struggle against misrule.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have noted with concern the renewed effort by the regime and its proxies to put out lies and propaganda against the National Unity Platform and its leadership. Like we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":15924,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-15932","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15932","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=15932"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/15932\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/15924"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=15932"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=15932"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=15932"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}