{"id":16117,"date":"2022-04-07T08:01:44","date_gmt":"2022-04-07T08:01:44","guid":{"rendered":"https:\/\/nupuganda.org\/?p=16117"},"modified":"2022-04-07T08:01:44","modified_gmt":"2022-04-07T08:01:44","slug":"president-kyagulanyi-ssentamu-roberts-address-at-the-geneva-summit-2022","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/president-kyagulanyi-ssentamu-roberts-address-at-the-geneva-summit-2022\/","title":{"rendered":"President Kyagulanyi Ssentamu Robert&#8217;s address at the Geneva Summit 2022"},"content":{"rendered":"\n<p>Yesterday, President Kyagulanyi Ssentamu Robert gave a keynote address on what it means to TOPPLE A DICTATOR at the GENEVA SUMMIT where Democracy and Humanity right were the main subjects for discussion. <\/p>\n\n\n\n<p>Below is his full speech. <\/p>\n\n\n\n<p>Thank you for the opportunity to share my story which also represents many Ugandans who have endured gross human rights Violations for the last 36years.<\/p>\n\n\n\n<p>I never intended to get into politics and neither did I pay much attention to the Political Space until my consciousness was awakened by personal humiliation at the hands of a security operative.<\/p>\n\n\n\n<p>I’m a musician, and in 2005, I was the hottest artist in town, singing about parties, girls and money, and like any successful 23-year-old, I bought a big fancy car: a Cadillac Escalade with spinning wheels and a personalized number plate “GHETTO”.<br>&nbsp;<br>One day, I was at a nightclub in Kampala when a security operative pulled me out of my car, slapped me in the face, held a gun to my head and said : “ Yo, why are you showing off? Don’t you know this country has owners?”<br>&nbsp;<br>I drove away humiliated, and this horrible feeling was all over me. A feeling of “you deserved it.” Because he was right – I thought I was safe, as a celebrity, partying with the rich and powerful military generals, wining and dining with them.<br>But it didn&#8217;t change the reality – that I was just a boy from the ghetto and that I would not be free from their oppressive rule until everyone in Uganda was free.<\/p>\n\n\n\n<p>That incident reminded me of the humiliation that many Ugandans faced everyday.<br>I couldn&#8217;t forgive myself for having allowed my temporary and deceptive elevevation in society to blind me from the plight of my fellow disadvantaged people and from that day I decided to be a voice for social Justice .<\/p>\n\n\n\n<p>For 36 years, Uganda has been under the rule of General Yoweri Museveni. More than 85% of Ugandans have seen no other President in their lifetime. Not because the Law allows but because he has always manipulated the Law with the help of a compromised Parliament and rigged Elections with the help of a personalised military.<\/p>\n\n\n\n<p>But regardless of all that the Western World, has continued to tolerate and enable Gen.Museveni because he is considered a &#8216;useful dictator,&#8217; good for regional security and national stability, even if he bends &#8220;a few Rules&#8221;. But that&#8217;s not true.<\/p>\n\n\n\n<p>Gen. Museveni rules Uganda with an iron hand, he deploys the military against citizens and even students. Those who oppose him are either imprisoned, tortured, or killed.<\/p>\n\n\n\n<p>His administration ranks one of the most corrupt in the world. His family members and henchmen have plundered our nation at the expense of healthcare, education and other social services.<br>&nbsp;<br>So sitting there in my fancy car, beaten and humiliated, I knew I could not stay silent any more.<br>So for the next ten years, I dedicated my music to the plight of the common people and fighting for human rights.<br>&nbsp;<br>In 2016 General Museveni rigged the election and declared himself president again. That&#8217;s when I decided that Since Parliament had refused to come to the ghetto, the ghetto would go to Parliament.<\/p>\n\n\n\n<p>In 2017, I decided to run for a Parliamentary Seat. Our constituency campaign turned into a national campaign and we won it with 80%.<br>Then we started the People Power Movement to awaken a generation of young Ugandans, talking to them about democracy and why its important for them to get involved. This annoyed Gen Museveni and we were branded as enemies.<br>&nbsp;<br>In 2018, while on a campaign trail in the Northern District of Arua, Gen. Museveni decided that it was too much for him to take. He alleged that our supporters had stoned his motorcade. And for that reason, the military was given orders to shoot and kill.<br>I had just stepped out of my car when I suddenly heard gun shots. My driver and friend, Yasin Kawuma was shot dead in a car seat that I had been occupying just a few minutes earlier.<br>&nbsp;<br>I tweeted out a photo of him lying in a pool of blood with a caption: “Police has shot my driver dead thinking they have shot at me.”<br>Then the Special Forces Command, a section of the military under Gen.Museveni&#8217;s son started hunting for me. For the next eight hours, I hid in a random hotel room as they broke down every single door looking for me. Meanwhile my tweet went viral and suddenly, the whole world was watching Museveni.<br>So when they finally found me, they could not kill me but they tortured me to near death.<\/p>\n\n\n\n<p>I was detained in a military base for several days and not even my family knew where I was.<br>&nbsp;<br>I later learnt that people protested in many parts of the World calling for my release and for this, I am forever grateful, because without that pressure maybe I would not be alive today.<\/p>\n\n\n\n<p>I was charged in the Miltary Court with Annoying the the President,Treason and illegal possession of Fire Arms-two machine guns were displayed to that effect. Ofcourse these were trumped up charges.<br>Out of shame, the fire arm charges were later dropped and the guns disappeared. Two and a half years later, the case has not been heard.<\/p>\n\n\n\n<p>So in 2019, I announced that I was running for President. Under Museveni&#8217;s regime, this means imprisonment, being forced into exile, or death, but we were ready for all that, and yes that&#8217;s exactly what happened.<br>We had the most violent campaign that one can ever imagine.<\/p>\n\n\n\n<p>In November 2020, I was arrested for allegedly violating COVID-19 regulations – a convenient excuse by Museveni’s regime to suppress his opponents. Our supporters protested against my illegal detention and the military went on rampage, they shot and killed hundreds of people although Museveni said only 54 protesters were killed.<br>Thousands were arrested and instead of accountability for this massacre, Museveni came out and praised the military for a job well done.<br>A few days later, my bodyguard Frank Ssenteza was deliberately ran over and killed by a military-police truck.<br>&nbsp;<br>Thousands of our supporters were then abducted by security operatives in unmarked vehicles, called drones in Uganda. As I speak now, many are still missing while others are still in illegal detention, for simply supporting me and our Party. Those who were lucky to return, came back with severe torture marks and horrifying stories of eyes and finger nails being plucked out, men being castrated and women being raped in detention.<br>&nbsp;<br>We never gave up and we will never give up. It wasn’t just me challenging General Museveni, it was an entire generation and for the first time, there were no tribal lines, no class lines or religious lines. We were speaking as ONE big voice. The entire population saying “People Power is Our Power.”<br>&nbsp;<br>It was the biggest public phenomenon I had ever seen. I had been a celebrity.&nbsp; I had done hit songs. I knew what it was like to be famous- to have people chanting your name but this was different.<br>&nbsp;<br>On election day, after casting my ballot I went home only to find hundreds of soldiers surrounding my house and I also learnt that the same was happening at our party offices all across the country. The Internet was switched off and mainstream Media was placed under strict Censorship. Any radio station that dared to report on the election was shut down immediately and many Journalists were arrested.<br>In this complete blackout, Museveni declared himself winner of the election. International authorities challenged the results as fraudulent, not free and not fair, meanwhile I remained under House arrest.<\/p>\n\n\n\n<p>It is not an exaggeration to say that my life is at stake because I live in Uganda. I have lost friends and colleagues at the hands of Security forces, I have been arrested and charged countless times and my only Crime is challenging Gen Museveni&#8217;s dictatorship.<br>&nbsp;&nbsp;<br>I am here to tell the World with clarity that Gen. Museveni is not the leader you think he is. He is a threat to the People of Uganda. The international community already recognised that the 2021 election in Uganda was neither free nor fair.<br>It is important that these words be followed with actions.<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>We call upon World Leaders to stop shaking Museveni&#8217;s blood-stained hands through funding and cooperation.<\/li><\/ol>\n\n\n\n<p>2.We call upon Governments and Organisations to impose sanctions on him and the people he uses to torture and murder innocent people.<\/p>\n\n\n\n<ol class=\"wp-block-list\" start=\"3\"><li>We call upon all those who value human rights and the rule of law to isolate Gen Museveni because he has distinguished himself as an excellent violator of human rights who has no respect for human life and dignity whatsoever.<\/li><\/ol>\n\n\n\n<p>4.We ask you to support our demands for accountability for the crimes against humanity that he has committed and continues to commit against the people of Uganda.<\/p>\n\n\n\n<p>For far too long the western world has been made to believed that allowing dictators to hold their nations hostage is an acceptable cost for perceived security.<br>Leaders who tolerate dictators and treat them as legitimate partners are complicit in their crimes. Please do not be partners in crime. Do not sacrifice your moral obligation for short term convenience. Stand on the right side of history.<\/p>\n\n\n\n<p>Thank you.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"What it means to Topple A dictator\" width=\"525\" height=\"295\" src=\"https:\/\/www.youtube.com\/embed\/TlEG2cdYHVw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe>\n<\/div><figcaption>President Bobi Wine&#8217;s full address at the #GenevaSummit2022<\/figcaption><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday, President Kyagulanyi Ssentamu Robert gave a keynote address on what it means to TOPPLE A DICTATOR at the GENEVA SUMMIT where Democracy and Humanity right were the main subjects [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":16118,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-16117","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16117","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=16117"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16117\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/16118"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=16117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=16117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=16117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}