{"id":16298,"date":"2022-07-15T13:17:05","date_gmt":"2022-07-15T13:17:05","guid":{"rendered":"https:\/\/nupuganda.org\/?p=16298"},"modified":"2022-07-15T13:17:05","modified_gmt":"2022-07-15T13:17:05","slug":"statement-on-the-unfortunate-incident-at-makerere-university-yesterday","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/statement-on-the-unfortunate-incident-at-makerere-university-yesterday\/","title":{"rendered":"Statement on the Unfortunate Incident at Makerere University Yesterday"},"content":{"rendered":"\n<p class=\"has-normal-font-size\">Yesterday on July 14, 2022, we held our final rally in the Guild presidential race at Makerere. Our candidate, Alionzi Lawrence, aka Dangote, held a massive and peaceful rally outside Nkrumah Hall. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">The campaign team then went to the Rugby grounds, where the campaign&#8217;s final rally was scheduled to take place. Our candidate addressed the mammoth crowd of students, charging them to turn up in large numbers and vote. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">As our campaign team left the Rugby Grounds, another group of mainly outsiders who had come to campaign for another candidate attacked our team members. They started beating them and throwing stones at them, asking why they were leaving the rugby grounds where their own candidate was expected to hold a rally there. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">There are several videos circulating showing how the supporters of NUP were running and jumping over fences for their dear lives. There are also videos showing how the other group was throwing stones and bottles at the NUP rally. There are pictures showing the violent group holding sharp objects and stones, charging towards the NUP camp. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">In the ensuing chaos, many of our supporters were indeed beaten up, and some of them were hospitalised. It should be noted that this was not the first time our campaign was attacked. Last week, the NRM campaign team, mostly comprised of hired thugs and operatives, attacked our team and caused several of them grave injuries. Some of them are still hospitalised. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">Anyway, it was a few minutes later that news started coming in that a student had been stabbed and was at Nsibirwa Hall. There were calls for help for the student who was bleeding profusely and needed urgent medical attention. Hon. Frank Kabuye was amongst the first responders, and since he had a vehicle, he immediately came in to help. That is how, together with other students, they rushed the bleeding student to the university hospital. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">At that time, they even thought the student belonged to comrade Dangote&#8217;s camp-but would still have helped him even if they knew he belonged to another camp. <br>Soon after, a police truck came to the university hospital, and they started arresting everyone they found there. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">Many students ran away, but others were arrested. At this point, no one knows who stabbed the student and the circumstances under which the heinous crime happened. It is unclear whether he was stabbed at Nsibirwa or from another point and only rushed to the hall for safety.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">What is clear, however, is that the violent group entered Nsibirwa and Nkrumah halls and started beating up other students simply because the two halls are solidly behind our candidate who resides there. There are many witnesses to this. We want to condemn in the strongest terms possible the acts of violence that led to the death of this student. We send heartfelt condolences to his family for losing such a young man at his prime. It is very regrettable. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">We strongly condemn the Uganda Police&#8217;s attempt to frame Kassanda South MP Hon. Kabuye Frank, as well as other leaders, in this heinous crime.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We demand transparent and independent investigations into this matter. We further condemn the attempts by the regime and other opportunists to politicise this tragedy at a time when all of us should be asking for answers. <\/p>\n\n\n\n<p class=\"has-normal-font-size\">Those who carried out this crime should be held to account, but there must be every effort to find the real culprits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday on July 14, 2022, we held our final rally in the Guild presidential race at Makerere. Our candidate, Alionzi Lawrence, aka Dangote, held a massive and peaceful rally outside [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-16298","post","type-post","status-publish","format-standard","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16298","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=16298"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16298\/revisions"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=16298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=16298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=16298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}