{"id":16452,"date":"2024-09-26T13:41:10","date_gmt":"2024-09-26T13:41:10","guid":{"rendered":"https:\/\/nupuganda.org\/?p=16452"},"modified":"2024-09-26T13:41:10","modified_gmt":"2024-09-26T13:41:10","slug":"presidents-full-speech-on-the-bulindo-incident","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/presidents-full-speech-on-the-bulindo-incident\/","title":{"rendered":"President’s Full Speech on the Bulindo incident"},"content":{"rendered":"\n<p class=\"has-normal-font-size\">September 6th, 2024<\/p>\n\n\n\n<p class=\"has-normal-font-size\">STATEMENT ON TUESDAY&#8217;S Showting<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Our friends and comrades in and out of Uganda,<\/p>\n\n\n\n<p class=\"has-normal-font-size\">It is purely by the grace of God that I am able to address you here today, still alive and able to speak.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">On Tuesday afternoon, together with some comrades, we set off from here [Magere] to visit our lawyer, Counsel George Musisi&#8217;s home in Bulindo-Kira Municipality, just about 5 miles away from here, for a private function.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Everything at the function went well, and we left his home without incident at about 5pm in the evening. But, like you must have seen some videos by now, having moved just a few meters away from Counsel Musisi&#8217;s home, we met police officers charging into our direction, shooting explosives at us, and at close range.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">You must have seen some of the comrades raising their hands up and pleading with the officers to stop the violence, but all in vain. The police descended upon these innocent comrades and brutalized them so badly as they struggled to make sense of the situation.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">When my driver saw them charging towards my car, he rolled up the widows of the car. Unfortunately, the roof of the car was not closed, so they sprayed paper spray into my car, which forced me and others to step out of the car. It was at that moment that the police aimed at me with what we learned was a teargas canister. It exploded right between my legs, and that&#8217;s how I ended up in this state.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I must be a very lucky man because during the presidential campaigns of 2021, a similar explosive was thrown at me by the police while I was addressing the people of Elegu border town in northern Uganda. It missed me, but it landed in the leg of an innocent lady called Zubeeda. She lost her leg, and up to now, she continues to face extreme hardship. There has been no justice for her, close to 4 years later.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">The same canister was thrown into a residential room at Lumumba Hall at Makerere University during a student’s protest. Later that evening, when comrade Sebuganda Richard returned to his room, it exploded right there, and he lost his right hand. On that treacherous campaign trail, shortly after they aimed at Ashraf Kasirye, nearly killing him, they aimed the same canister at a journalist, Ali Mivule, and injured him.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">In their initial statement, the police claim I stumbled and injured myself. It is a shame that one Kituuma Rusoke has taken over from where Enanga stopped. They&#8217;re trained to lie in broad daylight without shame. Then, they issued a second statement where they tried to change the narrative after some other videos of the incident came out.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">At this point I want to salute the ordinary citizens who recorded the events as they unfolded. I thank them for heeding our message of viewing their cameras as weapons. If these videos hadn&#8217;t come out, you can be sure they would have maintained the single narrative that I stumbled and injured myself! You all remember that Museveni&#8217;s minister made similar claims when Hon. Zaake was subjected to grave torture. He shamelessly told Parliament that Zaake caused his own injuries, which the High Court later on trashed.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Therefore, I want to make another call to the people of Uganda to always record all these human rights violations. Do it safely but firmly. You recall that after murdering our comrade Ritah Nabukenya, Enanga at the time claimed that day, police cameras were not working. When they murdered Frank Ssenteza at a spot with many cameras, we asked for footage, but they said they didn&#8217;t capture that incident. Same thing they did after the murder of Ziggy Wyne and Dan Kyeyune. This means that we can never hope to get footage from their own cameras; we must use our own cameras to capture the truth.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I saw Mr. Kituuma displaying videos of our previous events and also of some events after we had left the scene. But at the very spot where they attacked us, there are police cameras. The hypocrites did not show that footage, which would have settled the debate! Why?<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Away from that, let me say that often times the attention tends to be focused on me, like in this case, but these crimes affect many other people. On Tuesday, for instance, many comrades who were attacked and battered are still nursing serious injuries. You must have seen videos of police officers who we pay to protect us beating these comrades, boxing them, and kicking them with their boots. Totally unprovoked. Others are still detained at unknown places for no crime whatsoever. Comrades Lukenge Sharif, Ssentongo Emmanuel, and Kato Paul are still being detained illegally at Kira Division Police Station, way beyond the mandatory 48 hours!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Ladies and gentlemen, allow me to put the Tuesday shooting in context, especially for the benefit of those who think we&#8217;re exaggerating our circumstances.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Exactly one month ago, the head of security at our headquarters, comrade Achileo Kivumbi, was abducted near his home, tortured in military detention, and then finally charged in the Court Martial after many hours of illegal detention. Counsel Musisi, whom we had gone to visit, is his lawyer. Achileo joined a long list of known and unknown comrades of ours that the regime has turned into political prisoners since we started challenging Gen. Museveni. These political prisoners include Olivia Lutaaya, Machete Yasin, Kalanzi Sharif, and many others.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">At the start of this week, we were at Kitalya to check on several of these political prisoners.<br>We also visited the FDC activists who were picked from Kenya recently, brought back to Uganda without following any due process, tortured, and finally charged with treason.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">In the recent years, I have survived more than four assassination attempts. The very first attempt was in Arua in August 2018. That fateful day, Museveni’s guards, the SFC, shot dead my driver, Yasin Kawuma. They shot him, thinking it was me since throughout the day I had been sitting in the same spot he was when he met his death.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">On 1st December 2020, in Kayunga during the presidential campaign, the police threw a similar explosive at me. It exploded but luckily missed me by inches. The explosion tore the lips of my friend and music producer Dan Magic, who was standing next to me. It also removed his teeth. He has had to undergo several corrective surgeries since then. He is currently in the UK for another surgery on his jaw.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">That same 1st day of December 2020, we attempted to travel to Jinja for the remainder of the day&#8217;s campaign after taking Dan Magic to the hospital. In Jinja, the police and the military shot live bullets into the windscreen of our vehicle and in the tires. To date, I don&#8217;t know how we survived that shooting. It was just the power of God.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We survived many other shootings and incidents and fake accidents staged by the regime. Looking at all these incidents we have survived, we are convinced that the Museveni regime is determined to kill us. Only that they have still failed to create the perfect circumstances to assassinate us and then blame it on us. This is why they have tried so many times to provoke me and my team into a violent confrontation so that they use it as an excuse to justify the murder.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">They justified murdering Yasin Kawuma by claiming that so many of us held one stone and used it to shatter the windshield of Museveni’s bulletproof car. They would later lie that they found me with machine guns and that I fought with the military in order to justify the amount of torture they took me through. They are using a similar narrative to explain their actions on Tuesday.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I want to thank the comrades that we move with, the feet soldiers, for exhibiting extreme discipline and self-restraint even in circumstances when they would have been justified to use self-defense. It is this, our discipline, that is still standing in the way of those who plan to get us out of the way.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We have received information that most of the officers involved in the Tuesday operation are actually military officers only disguising as police. Others are hardened criminals that the regime uses to commit crimes against Ugandans and are heavily rewarded by Museveni.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We are also informed that the man who was dressed in a black t-shirt and police trousers whose photo went viral on social media is called Shadrack and was part of the notorious wembley group that conducted a number of extrajudicial killings before it was disbanded.<br>He masquerades as a pastor in Nakwero to hide his criminality.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">The man who threw that canister at me is called Twesigye Kaino Elias. His previous crimes against opposition leaders and supporters have been brought out, but as you can see, he has only been rewarded with promotions. You can be sure that nothing will be done to punish these criminals in uniform, but they will instead be rewarded.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Two days ago, the regime promoted Frank Mwesigwa to the rank of Assistant Inspector General of Police. Mwesigwa is the current director of operations in Uganda Police. His high-handed, criminal actions against us in Luuka led to the November 2020 massacre, which left over 150 innocent people shot dead. He was rewarded with a promotion! Same way, one Abaine who shot Ashraf Kasirye was promoted to Commissioner of Police. This was a message to other officers who still respect the law to act like the Mwesigwas of this world.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">Museveni himself sanctioned this criminality after the Arua incident. You remember, the shameless dictator said that there was an attempt to punish those who committed those crimes, but he stopped them, saying I was beaten very properly. That way, he assured these criminals of security and protection, as long as they dealt with his opponents ruthlessly. This explains the unprovoked violence that police visited upon us on Tuesday.<\/p>\n\n\n\n<p class=\"has-normal-font-size\">I sincerely appreciate all of you comrades and friends here and abroad for the love and solidarity you have shown us since Tuesday&#8217;s violence. I thank all of you comrades, as well as political, religious, and cultural leaders from Uganda, Africa, and the world who continue to reach out to us to express your sympathy. Comrades who have raised your voices at protests, press conferences, on social media, etc. to condemn what happened, we are grateful. Our diaspora chapters, thank you very much!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We hope that Uganda&#8217;s development partners will take Tuesday&#8217;s actions by the regime against peaceful and unarmed citizens as a wake-up call. In several ways, you our friends have knowingly or unknowingly sponsored our oppression. We encourage you to review the support you give dictator Museveni’s regime because he uses most of it against the citizens of this country. Please act and act fast because we&#8217;re dying!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">We also request that you hold accountable the commanders of security agencies that use lethal and unnecessary force and ammunition against citizens in clear violation of international law! You must walk the talk!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">As I conclude, I want to encourage all Ugandans of good will to remain firm in their demand for a better country. Whatever happens to anyone of us involved in the struggle, the survivors must keep up the fight until the war against dictatorship is won!<\/p>\n\n\n\n<p class=\"has-normal-font-size\">People power, our power!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>September 6th, 2024 STATEMENT ON TUESDAY&#8217;S Showting Our friends and comrades in and out of Uganda, It is purely by the grace of God that I am able to address [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":16461,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-16452","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-updates"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16452","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=16452"}],"version-history":[{"count":0,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16452\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/16461"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=16452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=16452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=16452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}