{"id":16615,"date":"2024-11-15T14:36:00","date_gmt":"2024-11-15T14:36:00","guid":{"rendered":"https:\/\/nupuganda.org\/?p=16615"},"modified":"2025-03-11T14:40:50","modified_gmt":"2025-03-11T14:40:50","slug":"resilience-in-the-face-of-electoral-injustice-the-peoples-struggle-for-democracy","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/resilience-in-the-face-of-electoral-injustice-the-peoples-struggle-for-democracy\/","title":{"rendered":"Resilience in the Face of Electoral Injustice: The People’s Struggle for Democracy"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>The People Power Movement emerged out of the Kyadondo East by-election. After that, we swept the subsequent by-elections in Bugiri and Arua. With our support, candidates in Jinja East and Rukungiri won. From that time, the regime moved in to cut our speed. They started in Hoima, where we camped to campaign for our sister, Hon. Asinasi Nyakato. They robbed her in broad daylight. Thankfully she made it in the general election.<\/p>\n\n\n\n<p>After the 2021 election, the regime murdered our L.C.5 chairman in Kayunga, which created a by-election. Our candidate Harriet Nakwedde won at ALL polling stations. The regime shamelessly declared the NRM candidate the winner , after Museveni went there and stated that no matter what we did, NRM would have the last word. In Soroti East, we supported the FDC candidate, Hon. Attan Moses. Yet again, the regime rigged that election with so much impunity. In the Omoro and Busongora South by-elections, the majority of our polling agents were arrested, and the regime engaged in ballot stuffing with reckless abandon. The same pattern followed in the Serere, Bukedea, Oyam, and Dokolo by-elections.<\/p>\n\n\n\n<p>We are certainly not saying that we would have won each of these by-elections. But there is all evidence to prove that they were neither free nor fair. Even in places where their candidates could potentially win comfortably, they engaged in massive ballot stuffing.<\/p>\n\n\n\n<p>The regime&#8217;s other strategy has been to inflate their own numbers and significantly reduce ours. Protests by our agents, even at the tally centers, are usually ignored.<\/p>\n\n\n\n<p>Kisoro was no exception. Firstly, candidates had only 11 days to campaign in a district with 24 sub-counties! This was clearly intended to benefit the NRM candidates, and we wrote a protest letter to the Electoral Commission, but they took no action. Come voting day, all day yesterday, the media was reporting a very low turnout in the election. But look at the results announced! Anyone can see that there was a deliberate effort to inflate the numbers of the two NRM-leaning candidates, and downplay ours. They did this even for the general election in 2021. In several places where we had massive support, they would try to reduce the winning margin for the Members of Parliament in order to justify the reduction of the votes for President. They often told our candidates, &#8220;Now that you have won, why do you care about the number of votes?&#8221; This happened in Wakiso, Kampala, Butambala, etc.<\/p>\n\n\n\n<p>In other places where they failed, you will find significant differences between the votes cast for president and members of parliament, even when people are given both ballots at a polling station.<\/p>\n\n\n\n<p>Come back to yesterday; by 10:00am, regime officials started reaching out to our polling agents with money and telling them if they resisted, they would be arrested. Many indeed gave in and abandoned their stations. Only a few resisted and reported what was happening.<\/p>\n\n\n\n<p>The regime does this to deliberately downplay our strength and to drive the narrative that the masses we attract do not necessarily translate into votes. Given that we&#8217;re heading towards the general election, they know this might have an effect on the psyche of the population, such that when they rig, they have recent by-elections to justify their theft!<\/p>\n\n\n\n<p>Certainly, there are many places where NUP and the larger opposition need to do much more work in mobilising and awakening people, and Kisoro is one of them. It is clear that even without the kind of rigging they engaged in, the independent candidate would still have won. (But what is true also is that the NUP candidate would have gotten many more votes than those allocated to her.) This is in part because in Kisoro (and Oyam) there was another dynamic of a protest vote against the official NRM candidates. The would-be opposition voters chose to unite behind candidates they considered having the best chance against the NRM.<\/p>\n\n\n\n<p>Therefore, friends, DO NOT BE DISCOURAGED. The struggle against dictatorship and misrule will involve many challenges before we get to victory. And yet we keep using all avenues, including elections, to awaken our people and push the message of freedom.<\/p>\n\n\n\n<p>I am very proud of our candidate, comrade Sultana Salim! She put up a very strong fight amidst very difficult odds.<\/p>\n\n\n\n<p>I am very grateful to the people of Kisoro for the massive reception they accorded us. We have moved from regime talk that there is no NUP in Kisoro, to now saying that NUP is not strong in Kisoro. That is a significant step made, and we shall build on that to move towards victory.<\/p>\n\n\n\n<p>Forward always—backward never. Aluta continua!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The People Power Movement emerged out of the Kyadondo East by-election. After that, we swept the subsequent by-elections in Bugiri and Arua. With our support, candidates in Jinja East and [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":16616,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[53],"tags":[],"class_list":["post-16615","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-nup-news"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16615","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=16615"}],"version-history":[{"count":1,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16615\/revisions"}],"predecessor-version":[{"id":16617,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16615\/revisions\/16617"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/16616"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=16615"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=16615"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=16615"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}