{"id":16638,"date":"2025-03-14T18:53:37","date_gmt":"2025-03-14T18:53:37","guid":{"rendered":"https:\/\/nupuganda.org\/?p=16638"},"modified":"2025-03-22T16:14:21","modified_gmt":"2025-03-22T16:14:21","slug":"heartfelt-tribute-from-our-secretary-general-david-lewis-rubongoya-following-our-victory-in-the-kawempe-north-bi-election","status":"publish","type":"post","link":"https:\/\/nupuganda.org\/heartfelt-tribute-from-our-secretary-general-david-lewis-rubongoya-following-our-victory-in-the-kawempe-north-bi-election\/","title":{"rendered":"Heartfelt Tribute From Our Secretary General, David Lewis Rubongoya Following Our Victory In The Kawempe North By-election"},"content":{"rendered":"\n<p>David Lewis Rubongoya, the Secretary General of the National Unity Platform has penned a heartfelt message of appreciation to the many individuals who played a critical role in securing the people’s victory in the recent Kawempe North By-election.<\/p>\n\n\n\n<p>In his message, he highlights the dedication and sacrifices made by polling agents, legal teams, medical personnel, volunteers, and ordinary citizens who stood firm in the face of intimidation and repression.<\/p>\n\n\n\n<p><strong>Below is his appreciation message <\/strong><br><br>THANK YOU.<\/p>\n\n\n\n<p>I have taken note of the many messages of appreciation from many of you, friends. I am extremely humbled that these little efforts towards making motherland better are recognised and appreciated by you all.<\/p>\n\n\n\n<p>However, let me say that whereas the light tends to shine most on us leaders, we have a wonderful team that we work with, under the overall leadership of our President, Kyagulanyi Ssentamu Robert.<\/p>\n\n\n\n<p>Some of these comrades are on the frontline of the cause, while many others work behind the scenes.<\/p>\n\n\n\n<p>In the case of yesterday, I want to appreciate all those who did everything within their power to ensure that the people&#8217;s victory was secured. THANK YOU.<\/p>\n\n\n\n<p>There are those who made sure we got our DR Forms on time &#8211; most of them jumping on boda-bodas while being chased by security operatives. THANK YOU.<\/p>\n\n\n\n<p>Our polling agents and supervisors, many of whom resisted illegal orders to leave their stations. There were attempts to compromise some, but most stood their ground. THANK YOU.<\/p>\n\n\n\n<p>The different political leaders who offered financial and logistical support to the campaign, but were also present to protect the vote at great personal risk. THANK YOU.<\/p>\n\n\n\n<p>There are those who were running to different hospitals to ensure that our injured comrades got treatment, and the doctors who were attending to them. THANK YOU.<\/p>\n\n\n\n<p>There are those who delivered food and water to our polling agents and supervisors to ensure they did not leave their stations. THANK YOU.<\/p>\n\n\n\n<p>The lawyers who were running from police station to another to offer legal aid to those arrested. THANK YOU.<\/p>\n\n\n\n<p>Our welfare team, who were updating family members of those arrested or abducted and availing those arrested with food and water. THANK YOU.<\/p>\n\n\n\n<p>Our security team who tried their best to evacuate some leaders and comrades from harm&#8217;s way. THANK YOU.<\/p>\n\n\n\n<p>The members of our Election Management Committee who were with us at the tally centre doing our independent tally and quickly locating the anomalies. THANK YOU.<\/p>\n\n\n\n<p>The many volunteers who spent the day making reports of whatever was going on, and the ordinary citizens who were being pushed off polling stations by the military and yet refusing to go far away. Many hid in buildings adjacent to polling stations and kept an eye on the goings on. THANK YOU.<\/p>\n\n\n\n<p>Those who took great risks, taking pictures, and recording videos under very dangerous circumstances so that we kept updating the country after the media had been battered and forced to withdraw. THANK YOU.<\/p>\n\n\n\n<p>Our diaspora team and EVERYBODY else.<\/p>\n\n\n\n<p>Above all, the GREAT PEOPLE of Kawempe North who resisted all manner of intimidation to deliver comrade Nalukoola&#8217;s victory. THANK YOU.<\/p>\n\n\n\n<p>I am persuaded beyond measure that if this Unity of Purpose can continue and even grow, our victory will be closer than we all imagine.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>David Lewis Rubongoya, the Secretary General of the National Unity Platform has penned a heartfelt message of appreciation to the many individuals who played a critical role in securing the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":16640,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[53],"tags":[],"class_list":["post-16638","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-nup-news"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16638","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=16638"}],"version-history":[{"count":4,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16638\/revisions"}],"predecessor-version":[{"id":16705,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/posts\/16638\/revisions\/16705"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media\/16640"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=16638"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/categories?post=16638"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/tags?post=16638"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}