{"id":1486,"date":"2024-12-24T10:58:56","date_gmt":"2024-12-24T10:58:56","guid":{"rendered":"https:\/\/nupuganda.org\/?page_id=1486"},"modified":"2025-03-06T15:54:42","modified_gmt":"2025-03-06T15:54:42","slug":"president-biography","status":"publish","type":"page","link":"https:\/\/nupuganda.org\/president-biography\/","title":{"rendered":"President&#8217;s Biography"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"1486\" class=\"elementor elementor-1486\">\n\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-73eb122 elementor-section-full_width elementor-section-height-default elementor-section-height-default\" data-id=\"73eb122\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-063c4c5\" data-id=\"063c4c5\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-2421c18 elementor-widget elementor-widget-whitehall_information_and_attractions\" data-id=\"2421c18\" data-element_type=\"widget\" data-widget_type=\"whitehall_information_and_attractions.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t        \n        <!-- information-section -->\n        <section class=\"information-section bg-color-1\">\n            <div class=\"bg-layer\" style=\"background-image: url();\"><\/div>\n            <div class=\"auto-container\">\n                <div class=\"sec-title centred light\">\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t<h2>President's Biography<\/h2>\n\t\t\t\t\t<div class=\"title-shape\"><\/div>\n\t\t\t\t\t                <\/div>\n                <div class=\"inner-content\">\n                    <div class=\"schedule-carousel\">\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">01.<\/span>\n                                <div class=\"icon-box\"><i class=\"icon flaticon-diagram\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>President Kyagulanyi Ssentamu Robert.<\/h4>\n                                    <p>Kyagulanyi Ssentamu Robert (born 12 February 1982), popularly known by his stage name Bobi Wine, is a Ugandan activist, politician, singer, actor and Lawyer. He is a former Member of Parliament for Kyadondo County East constituency in Wakiso District, in Uganda's Central Region.\nKyagulanyi was born in Nkozi Hospital, where his mother worked as a midwife. He grew up in the Kamwokya slum in the northeastern part of Kampala, the capital city of Uganda.\nKyagulanyi attended Kitante Hill School, where he attained his Uganda Certificate of Education in 1996, as well as Kololo Senior Secondary School, where he attained his Uganda Advanced Certificate of Education in 1998. He then attended Makerere University in Kampala, where he studied music, dance, and drama, graduating with a diploma in 2003. \nIn 2016, Kyagulanyi joined the International University of East Africa for a Bachelor of Laws degree. Following the advice of his constitutional law lecturer, David Lewis Rubongoya, he transferred from IUEA, which was not fully accredited to teach law at the time, to Cavendish University, which was already accredited. He graduated from Cavendish University in August 2024\n<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">02.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>The Bobi Wine Edutainment<\/h4>\n                                    <p>Mr. Kyagulanyi developed a humanitarian and politically focused musical genre in 2006, one which entertains while also conveying educational messages, particularly to the underprivileged residents of Kampala's suburbs, including the Ghetto. \nSome notable works include \"Ghetto\" (featuring Nubian Li), \"Obuyonjo,\" \"Obululu Tebutwawula,\" \"Time Bomb,\" and others.\nThe messages contained in these music projects were typically aimed at politicians, urging them to take greater care of the underprivileged, as well as encouraging ordinary citizens to be more responsible in their communities. Topics covered include hygiene, maternal health, child pregnancies, child marriages, domestic violence and HIV\/AIDS.\nWine's music resonated strongly with the public, earning him the nickname \"Ghetto President\" and helping him establish a prominent position in Ugandan politics later in his career.\n<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">03.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>Film career<\/h4>\n                                    <p>Kyagulanyi is also a film actor, mainly starring in local Ugandan movies. In 2010, he was cast in Cleopatra Koheirwe's drama film Yogera. In 2015, he was cast in a lead role in the Twaweza-supported film Situka with Hellen Lukoma. He has also worked on a number of other films, including Divizionz. Bobi Wine had his own reality TV show named The Ghetto President.\nHe appears in the 2023 documentary Bobi Wine: The People's President directed by Moses Bwayo and Christopher Sharp. It was shot over five years and follows Wine and his wife on the campaign trail leading to the 2021 Presidential election. The documentary won a Peabody Award at the 84th ceremony in 2024 and was nominated for Best Documentary Feature at the 2024 Oscars.<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">04.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>Political career<\/h4>\n                                    <p>In April 2017, Kyagulanyi announced his candidacy for parliament in a by-election for Kyadondo County East constituency. His door-to-door walking campaign attracted attention both in Uganda and abroad. He won the contest by a wide margin, beating two seasoned candidates: Sitenda Sebalu of the ruling National Resistance Movement (NRM) party and Apollo Kantinti of the main opposition party Forum for Democratic Change.\nIn 2018, Kyagulanyi gained increasing fame, championing the victories in most of the by-elections by the candidates he campaigned for, thus beating out NRM and FDC candidates.<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">05.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>Anti-social media tax protest<\/h4>\n                                    <p>On 22 April 2019, Kyagulanyi was arrested, detained and charged with leading a protest in the city the previous year without prior police authorization; the protest was held against the \"social media tax\" which took effect in July 2018. \nOn 29 April 2019, on his way to the offices of the Criminal Investigations Directorate (CID) to honor a summon and provide a statement on the cancelled concert, Kyagulanyi was again arrested and taken to Buganda Road Court, where he was charged with disobedience of statutory duty and remanded to Luzira Maximum Security Prison until his bail hearing on 2 May. \nIn a statement the following day, Amnesty International demanded his immediate release and urged the Ugandan government to \"stop misusing the law in a shameless attempt to silence him for criticizing the government.\nOn the day of the hearing, which was conducted via video conferencing (the first time in the history of Uganda's justice system), Kyagulanyi was granted bail and released from prison, with the court also barring him from holding “unlawful” demonstrations.<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">06.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>2021 presidential election<\/h4>\n                                    <p>On 24 July 2019, Kyagulanyi formally announced his bid to run for president in the 2021 general election. Kyagulanyi was formally nominated to run for the highest office of presidency on 3 Nov 2020. Shortly after his nomination, Kyagulanyi was arrested by the Ugandan military.\nOn 6 November 2020, he launched his campaign manifesto in Mbarara (western Uganda) after state operatives cordoned off his NUP party offices preventing him from launching the manifesto from there as planned.\nOn 18 November 2020, Kyagulanyi was arrested in Luuka District (Eastern Uganda) and detained at Nalufenya Police Station in Jinja for 3 days. \"Police accused Mr. Kyagulanyi of having more than 200 supporters recommended by the EC to contain further spread of Covid-19.\n\nHis arrest was met by widespread demonstration around the country mostly in parts of Kampala, Masaka, Jinja, Mukono, Mbale and Wakiso. Although the Uganda police alleged that only 54 people were killed, human right activists put the figure to more than 100 murdered and several others injured. Over 2000 people were incarcerated during the subsequent protests.\nKyagulanyi's bodyguard Francis Senteza was murdered on 27 December 2020, after being run over by a truck belonging to the military police. He was attacked while helping to transport a journalist critically injured by tear gas during an earlier confrontation between the police and a group of Kyagulanyi's supporters. Another journalist was also wounded in the incident.\nKyagulanyi was placed under house arrest on 15 January, shortly after casting his vote for the presidential election. The military surrounded his home and did not let anyone in or out for several days, despite Kyagulanyi claiming he had run out of food. \nThe U.S. ambassador to Uganda, Natalie E. Brown was not allowed to visit or leave food for him as the military blocked the convoy. Kyagulanyi was released on 26 January after the Ugandan High Court ordered security forces to end the house arrest. \nOn 1 February, Kyagulanyi challenged the 2021 elections in court, but later ordered his lawyers to withdraw the case citing bias from the judges, after photos were seen of the chief justice with President Museveni, who was the correspondent party to the lawsuit.\n<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                                <div class=\"information-block-one\">\n                            <div class=\"inner-box\">\n                                <span class=\"count\">07.<\/span>\n                                <div class=\"icon-box\"><i class=\"\"><\/i><\/div>\n                                <div class=\"text\">\n                                    <h4>Humanitarian work<\/h4>\n                                    <p>Kyagulanyi has supported several practical projects to improve conditions for the poor. In 2012, he started a campaign to promote more regular cleaning in hospitals, sanitation, garbage management, and hand-washing to prevent disease. \nIn 2012 he donated funds to build pit latrines and construct a drainage channel in Kisenyi II, a Kampala slum that the New Vision described as being \"characterized by filth, crowded shanty structures, poor sanitation and lack of basic social facilities.\" Kyagulanyi explained that he embarked on the project \"because these are my people, and no matter where I go, this will always be home.”\nHe has also campaigned for malaria prevention, with donations to Nakasongola Health Centre, and references to the disease in his songs.\nIn August 2013, Kyagulanyi visited the Bundibugyo Refugee Camp in Bundibugyo District, along with representatives from Save the Children, UNHCR, and the Red Cross, to deliver funds and supplies. \nThe following month, he was named as a parenting ambassador by Twaweza, an NGO that focuses on education and citizen engagement in East Africa; his message in this partnership was to promote responsible parenting among his Ugandan fans. In an interview about the project, he said that \"education is what will ultimately change the course of our country and as an artiste and a father, I believe we can all make a difference in our children's learning.\n\nIn 2014, Kyagulanyi was named as an ambassador for Save the Children's EVERY ONE campaign, joining a team of 14 Ugandan artists who recorded a special song and video about maternal and child health. Other leading artists in the video included Jose Chameleone, and Radio and Weasel, who made up the Goodlyfe Crew.\nKyagulanyi and his wife Barbara travelled to hospitals throughout Uganda, including Nakaseke Hospital, meeting with midwives and health workers to popularize the campaign. Save the Children also took him to other regions for the campaign, including Nyumanzi Refugee Settlement in northwestern Uganda for South Sudanese people. \nCurrently, Bobi Wine is the Patron of a girls and teen mothers’ empowerment Non-Government Organization called Caring Hearts Uganda, founded by his wife Barbie Kyagulanyi. About Caring Hearts Uganda - Nonprofit for menstrual health in Uganda.\nKyagulanyi was scheduled to perform a show in Dubai, United Arab Emirates on October 8, 2022, and the proceeds from the show were going to be used to repatriate Ugandans stranded in the United Arab Emirates. However, the show was canceled by the United Arab Emirates government on unknown grounds and upon arrival in Dubai, Kyagulanyi was detained at the airport for ten hours. He was later released and spoke to support.<\/p>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t                                <\/div>\n                            <\/div>\n                        <\/div>\n                                            <\/div>\n                <\/div>\n            <\/div>\n        <\/section>\n        <!-- information-section end -->\n\n        \t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-dad43f0 elementor-section-full_width elementor-section-height-default elementor-section-height-default\" data-id=\"dad43f0\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-5988bed\" data-id=\"5988bed\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-43871b8 elementor-widget elementor-widget-whitehall_team_v1\" data-id=\"43871b8\" data-element_type=\"widget\" data-widget_type=\"whitehall_team_v1.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t        \n\t\t<!-- team-section -->\n        <section class=\"team-section sec-pad \">\n\t\t\t            <div class=\"auto-container\">\n                <div class=\"sec-title\">\n\t\t\t\t\t                    <h6><i class=\"flaticon-star\"><\/i><span>Our Team<\/span><\/h6>\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t                    <h2>Meet Our Leadership<\/h2>\n                    <div class=\"title-shape\"><\/div>\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t                    <a href=\"#\" class=\"theme-btn\">All members<\/a>\n\t\t\t\t\t                <\/div>\n                <div class=\"row clearfix\">\n                                        <div class=\"col-lg-3 col-md-6 col-sm-12 team-block\">\n                        <div class=\"team-block-one wow fadeInUp animated animated\" data-wow-delay=\"200ms\" data-wow-duration=\"1500ms\">\n                            <div class=\"inner-box\">\n                                <figure class=\"image-box\"><img fetchpriority=\"high\" decoding=\"async\" width=\"270\" height=\"270\" src=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-270x270.jpg\" class=\"attachment-whitehall_270x270 size-whitehall_270x270 wp-post-image\" alt=\"\" srcset=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-270x270.jpg 270w, https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-150x150.jpg 150w, https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-120x120.jpg 120w, https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-60x60.jpg 60w, https:\/\/nupuganda.org\/wp-content\/uploads\/2021\/05\/Kyagulanyi-Ssentamu-Robert-2-70x70.jpg 70w\" sizes=\"(max-width: 270px) 100vw, 270px\" \/><\/figure>\n                                <div class=\"lower-content\">\n                                    <div class=\"author-box\">\n                                        <h4>Robert Kyagulanyi Ssentamu<\/h4>\n                                        <span class=\"designation\">President<\/span>\n                                    <\/div>\n                                    <ul class=\"othre-info clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t                                        <li class=\"share-option\">\n                                            <i class=\"share-icon flaticon-share\"><\/i>\n                                            <ul class=\"share-links clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li><a href=\"https:\/\/nupuganda.org\/president-biography\/\" style=\"background-color:; color: \" target=\"_blank\"><i class=\"fab fa-tencent-weibo\"><\/i><\/a><\/li>\n\t\t\t\t\t\t\t\t\t\t\t\t                                            <\/ul>\n                                        <\/li>\n\t\t\t\t\t\t\t\t\t\t                                    <\/ul>\n                                <\/div>\n                            <\/div>\n                        <\/div>\n                    <\/div>\n\t\t\t\t\t                    <div class=\"col-lg-3 col-md-6 col-sm-12 team-block\">\n                        <div class=\"team-block-one wow fadeInUp animated animated\" data-wow-delay=\"200ms\" data-wow-duration=\"1500ms\">\n                            <div class=\"inner-box\">\n                                <figure class=\"image-box\"><img decoding=\"async\" width=\"270\" height=\"270\" src=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-270x270.jpg\" class=\"attachment-whitehall_270x270 size-whitehall_270x270 wp-post-image\" alt=\"\" srcset=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-270x270.jpg 270w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-150x150.jpg 150w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-120x120.jpg 120w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-60x60.jpg 60w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Nambeshe-John-Baptist-2-70x70.jpg 70w\" sizes=\"(max-width: 270px) 100vw, 270px\" \/><\/figure>\n                                <div class=\"lower-content\">\n                                    <div class=\"author-box\">\n                                        <h4>Nambeshe John Baptist<\/h4>\n                                        <span class=\"designation\">Deputy President-Eastern Uganda<\/span>\n                                    <\/div>\n                                    <ul class=\"othre-info clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t                                        <li class=\"share-option\">\n                                            <i class=\"share-icon flaticon-share\"><\/i>\n                                            <ul class=\"share-links clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t                                            <\/ul>\n                                        <\/li>\n\t\t\t\t\t\t\t\t\t\t                                    <\/ul>\n                                <\/div>\n                            <\/div>\n                        <\/div>\n                    <\/div>\n\t\t\t\t\t                    <div class=\"col-lg-3 col-md-6 col-sm-12 team-block\">\n                        <div class=\"team-block-one wow fadeInUp animated animated\" data-wow-delay=\"200ms\" data-wow-duration=\"1500ms\">\n                            <div class=\"inner-box\">\n                                <figure class=\"image-box\"><img decoding=\"async\" width=\"270\" height=\"270\" src=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-270x270.jpg\" class=\"attachment-whitehall_270x270 size-whitehall_270x270 wp-post-image\" alt=\"\" srcset=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-270x270.jpg 270w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-150x150.jpg 150w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-120x120.jpg 120w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-60x60.jpg 60w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Lina-Zedriga-Waru-2-70x70.jpg 70w\" sizes=\"(max-width: 270px) 100vw, 270px\" \/><\/figure>\n                                <div class=\"lower-content\">\n                                    <div class=\"author-box\">\n                                        <h4>Lina Zedriga Waru<\/h4>\n                                        <span class=\"designation\">Deputy President-Northern Uganda<\/span>\n                                    <\/div>\n                                    <ul class=\"othre-info clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t                                        <li class=\"share-option\">\n                                            <i class=\"share-icon flaticon-share\"><\/i>\n                                            <ul class=\"share-links clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t                                            <\/ul>\n                                        <\/li>\n\t\t\t\t\t\t\t\t\t\t                                    <\/ul>\n                                <\/div>\n                            <\/div>\n                        <\/div>\n                    <\/div>\n\t\t\t\t\t                    <div class=\"col-lg-3 col-md-6 col-sm-12 team-block\">\n                        <div class=\"team-block-one wow fadeInUp animated animated\" data-wow-delay=\"200ms\" data-wow-duration=\"1500ms\">\n                            <div class=\"inner-box\">\n                                <figure class=\"image-box\"><img loading=\"lazy\" decoding=\"async\" width=\"270\" height=\"270\" src=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-270x270.jpg\" class=\"attachment-whitehall_270x270 size-whitehall_270x270 wp-post-image\" alt=\"\" srcset=\"https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-270x270.jpg 270w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-150x150.jpg 150w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-120x120.jpg 120w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-60x60.jpg 60w, https:\/\/nupuganda.org\/wp-content\/uploads\/2025\/02\/Muhammad-Muwanga-Kivumbi-2-70x70.jpg 70w\" sizes=\"(max-width: 270px) 100vw, 270px\" \/><\/figure>\n                                <div class=\"lower-content\">\n                                    <div class=\"author-box\">\n                                        <h4>Muhammad Muwanga Kivumbi<\/h4>\n                                        <span class=\"designation\">Deputy President- Central Region<\/span>\n                                    <\/div>\n                                    <ul class=\"othre-info clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t                                        <li class=\"share-option\">\n                                            <i class=\"share-icon flaticon-share\"><\/i>\n                                            <ul class=\"share-links clearfix\">\n\t\t\t\t\t\t\t\t\t\t\t\t                                            <\/ul>\n                                        <\/li>\n\t\t\t\t\t\t\t\t\t\t                                    <\/ul>\n                                <\/div>\n                            <\/div>\n                        <\/div>\n                    <\/div>\n\t\t\t\t\t                <\/div>\n            <\/div>\n        <\/section>\n        <!-- team-section end -->\n\n        \t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>President&#8217;s Biography 01. President Kyagulanyi Ssentamu Robert. Kyagulanyi Ssentamu Robert (born 12 February 1982), popularly known by his stage name Bobi Wine, is a Ugandan activist, politician, singer, actor and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"tpl-default-elementor.php","meta":{"footnotes":""},"class_list":["post-1486","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/pages\/1486","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/comments?post=1486"}],"version-history":[{"count":13,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/pages\/1486\/revisions"}],"predecessor-version":[{"id":16598,"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/pages\/1486\/revisions\/16598"}],"wp:attachment":[{"href":"https:\/\/nupuganda.org\/wp-json\/wp\/v2\/media?parent=1486"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}